Repository: gunjanginoyadev/canadian_citizenship_test
Catalog: lib/l10n/app_*.arb
Languages: hi, id, ur, vi

# onboarding_one_title
source: Welcome to the Canadian Citizenship Test
hi: कनाडा नागरिकता परीक्षा में आपका स्वागत है
id: Selamat Datang di Tes Kewarganegaraan Kanada
ur: کینیڈین شہریت کے ٹیسٹ میں خوش آمدید
vi: Chào mừng đến với Bài thi Quốc tịch Canada

# onboarding_one_desc
source: Study the latest material, practice using Quizzes, test your knowledge using tests!
hi: नवीनतम सामग्री पढ़ें, प्रश्नोत्तरी के साथ अभ्यास करें और परीक्षाओं के साथ अपने ज्ञान का परीक्षण करें।
id: Pelajari materi terbaru, latihan dengan kuis, dan uji pengetahuan Anda dengan ujian.
ur: تازہ ترین مواد سیکھیں، کوئزز کے ساتھ مشق کریں، اور پریکٹس ٹیسٹ کے ذریعے اپنی معلومات کو جانچیں۔
vi: Học tài liệu mới nhất, luyện tập với các câu đố và kiểm tra kiến thức bằng các bài thi thử.

# onboarding_two_title
source: Access to Full Official Study Guide
hi: आधिकारिक पूर्ण गाइड तक पहुंच
id: Akses Panduan Resmi Lengkap
ur: مکمل آفیشل گائیڈ تک رسائی
vi: Truy cập Hướng dẫn Chính thức Đầy đủ

# onboarding_two_desc
source: Study the latest version of Discover Canada and learn everything you need to know for the test.
hi: Discover Canada के नवीनतम संस्करण को पढ़ें और परीक्षा के लिए आवश्यक सभी चीजें सीखें।
id: Pelajari versi terbaru Discover Canada dan ketahui semua yang perlu dipelajari untuk ujian.
ur: Discover Canada کا تازہ ترین ورژن پڑھیں اور ٹیسٹ کے لیے درکار تمام معلومات حاصل کریں۔
vi: Học phiên bản mới nhất của Discover Canada và nắm bắt mọi thứ bạn cần cho bài thi.

# onboarding_three_title
source: Practice with Quizzes and Tests
hi: प्रश्नोत्तरी और परीक्षा का अभ्यास करें
id: Latihan dengan Kuis & Ujian
ur: کوئزز اور ٹیسٹ کے ساتھ مشق کریں
vi: Luyện tập với câu đố và bài kiểm tra

# onboarding_three_desc
source: Get ready for the test by doing the practice tests and Quizzes based on the actual citizenship test.
hi: असली परीक्षा पर आधारित अभ्यास परीक्षाओं और प्रश्नोत्तरी के साथ खुद को तैयार करें।
id: Persiapkan diri Anda dengan mengikuti ujian latihan dan kuis yang didasarkan pada tes nyata.
ur: اصلی امتحان پر مبنی پریکٹس ٹیسٹ اور کوئزز کے ساتھ تیاری کریں۔
vi: Chuẩn bị bằng các bài kiểm tra thử và câu đố dựa trên bài thi thực tế.

# onboarding_four_title
source: Keep Track of Your Progress
hi: अपनी प्रगति पर नज़र रखें
id: Lacak Kemajuan Anda
ur: اپنی ترقی کو ٹریک کریں
vi: Theo dõi tiến trình của bạn

# onboarding_four_desc
source: Keep track of your progress through the material, quizzes and tests.
hi: सामग्री, प्रश्नोत्तरी और परीक्षा में अपनी प्रगति को ट्रैक करें।
id: Pantau kemajuan Anda melalui materi, kuis, dan ujian.
ur: مواد، کوئزز اور ٹیسٹ میں اپنی پیش رفت کو دیکھیں۔
vi: Xem tiến trình của bạn trong tài liệu, câu đố và bài kiểm tra.

# onboarding_five_title
source: Detailed Question Explanations
hi: विस्तृत प्रश्न व्याख्याएं
id: Penjelasan Detail Pertanyaan
ur: سوالات کی تفصیلی وضاحت
vi: Giải thích chi tiết cho các câu hỏi

# onboarding_five_desc
source: Learn by doing questions and getting feedback on your answers.
hi: प्रश्नों का उत्तर देकर सीखें और अपनी प्रतिक्रियाओं पर प्रतिक्रिया प्राप्त करें।
id: Belajar dengan menjawab pertanyaan dan mendapatkan umpan balik tentang jawaban Anda.
ur: سوالات کے جوابات دے کر سیکھیں اور اپنی کارکردگی کے بارے میں فیڈبیک حاصل کریں۔
vi: Học thông qua trả lời câu hỏi và nhận phản hồi về câu trả lời của bạn.

# skip_with_space
source: S K I P
id: L E W A T
ur: سکپ کریں
vi: B Ỏ Q U A

# next_with_space
source: N E X T
id: B E R I K U T
ur: اگلا
vi: T I Ế P

source: By continuing, you
hi: जारी रखकर, आप स्वीकार करते हैं
id: Dengan melanjutkan, Anda setuju dengan
ur: جاری رکھ کر، آپ ہماری
vi: Bằng cách tiếp tục, bạn đồng ý với

# agree_to_out_privacy_policy
source: agree to our Privacy Policy
hi: हमारी गोपनीयता नीति
id: Kebijakan Privasi kami
ur: پرائیویسی پالیسی
vi: Chính sách quyền riêng tư

source: and
hi: और
id: dan
ur: اور
vi: và

source: Terms of Service
hi: सेवा की शर्तें
id: Ketentuan Layanan
ur: سروس کی شرائط سے اتفاق کرتے ہیں
vi: Điều khoản dịch vụ

source: When is your test?
hi: आपकी परीक्षा कब है?
id: Kapan tes Anda?
ur: آپ کا ٹیسٹ کب ہے؟
vi: Khi nào là bài thi của bạn?

# when_is_your_test_desc
source: We'll show you the remaining days to your test and send you reminder notifications.
hi: हम आपको आपकी परीक्षा तक शेष दिन दिखाएंगे और आपको याद दिलाएंगे।
id: Kami akan menunjukkan jumlah hari tersisa untuk tes Anda dan mengirimkan pengingat.
ur: ہم آپ کو بتائیں گے کہ آپ کے ٹیسٹ میں کتنے دن باقی ہیں اور یاد دہانی بھیجیں گے۔
vi: Chúng tôi sẽ hiển thị số ngày còn lại đến bài thi và gửi nhắc nhở.

# select_cap
source: SELECT
hi: चयन करें
id: PILIH
ur: منتخب کریں
vi: CHỌN

# skip_cap
source: SKIP
hi: स्किप करें
id: LEWATKAN
ur: سکپ کریں
vi: BỎ QUA

source: Welcome there!
hi: स्वागत है!
id: Selamat Datang!
ur: خوش آمدید!
vi: Chào mừng!

# pro_cap
source: PRO
hi: प्रो
ur: پریمیم

source: Unlock all premium features
hi: सभी प्रीमियम सुविधाओं को अनलॉक करें
id: Buka semua fitur premium
ur: تمام پریمیم فیچرز کو انلاک کریں
vi: Mở khóa tất cả tính năng cao cấp

source: Details
hi: विवरण
id: Detail
ur: تفصیلات
vi: Chi tiết

source: Your test date has passed
hi: आपकी परीक्षा की तारीख गुजर गई है
id: Tanggal tes Anda telah lewat
ur: آپ کی ٹیسٹ کی تاریخ گزر چکی ہے
vi: Ngày thi của bạn đã qua

source: Continue studying
hi: अध्ययन जारी रखें
id: Lanjutkan belajar
ur: پڑھائی جاری رکھیں
vi: Tiếp tục học

source: No lesson available
hi: कोई पाठ उपलब्ध नहीं है
id: Tidak ada pelajaran yang tersedia
ur: کوئی سبق دستیاب نہیں
vi: Không có bài học nào

source: Completed
hi: पूरा हुआ
id: Selesai
ur: مکمل ہوا
vi: Hoàn thành

source: Glossary
hi: शब्दावली
id: Glosarium
ur: لغت
vi: Thuật ngữ

source: No data found
hi: कोई डेटा नहीं मिला
id: Data tidak ditemukan
ur: کوئی ڈیٹا نہیں ملا
vi: Không tìm thấy dữ liệu

source: Search
hi: खोजें
id: Cari
ur: تلاش کریں
vi: Tìm kiếm

# mock_test
source: Mock Tests
hi: मॉक टेस्ट
id: Tes Simulasi
ur: پریکٹس ٹیسٹ
vi: Bài kiểm tra thử

source: Test Progress
hi: परीक्षा प्रगति
id: Kemajuan Tes
ur: ٹیسٹ کی پیش رفت
vi: Tiến trình kiểm tra

# question
source: Questions
hi: प्रश्न
id: Pertanyaan
ur: سوال
vi: Câu hỏi

source: Progress
hi: प्रगति
id: Kemajuan
ur: پیش رفت
vi: Tiến trình

source: Question Progress
hi: प्रश्न प्रगति
id: Kemajuan Pertanyaan
ur: سوال کی پیش رفت
vi: Tiến trình câu hỏi

source: out of
hi: में से
id: dari
ur: میں سے
vi: trong

source: Next
hi: अगला
id: Berikutnya
ur: اگلا
vi: Tiếp

# test_results
source: Test Result
hi: परीक्षा परिणाम
id: Hasil Tes
ur: ٹیسٹ کے نتائج
vi: Kết quả kiểm tra

source: Correct
hi: सही
id: Benar
ur: درست
vi: Đúng

source: Wrong
hi: गलत
id: Salah
ur: غلط
vi: Sai

# try_again_acpt
source: TRY AGAIN
hi: फिर से प्रयास करें
id: COBA LAGI
ur: دوبارہ کوشش کریں
vi: Thử lại

source: Review your answers
hi: अपने उत्तरों की समीक्षा करें
id: Tinjau jawaban Anda
ur: اپنے جوابات کا جائزہ لیں
vi: Xem lại câu trả lời của bạn

source: All
hi: सभी
id: Semua
ur: تمام
vi: Tất cả

source: Skipped
hi: छोड़ा गया
id: Dilewati
ur: چھوڑا گیا
vi: Bỏ qua

source: Lesson List
hi: पाठ सूची
id: Daftar Pelajaran
ur: سبق کی فہرست
vi: Danh sách bài học

source: Lesson
hi: पाठ
id: Pelajaran
ur: سبق
vi: Bài học

source: Adjust Font Size
hi: फ़ॉन्ट आकार समायोजित करें
id: Sesuaikan Ukuran Font
ur: فونٹ سائز ایڈجسٹ کریں
vi: Điều chỉnh cỡ chữ

source: Stop
hi: रोकें
id: Berhenti
ur: روکیں
vi: Dừng

source: Listen
hi: सुनें
id: Dengarkan
ur: سنیں
vi: Nghe

source: Next Lesson
hi: अगला पाठ
id: Pelajaran Berikutnya
ur: اگلا سبق
vi: Bài học tiếp theo

source: Finish
hi: समाप्त करें
id: Selesai
ur: مکمل کریں
vi: Hoàn thành

source: Settings
hi: सेटिंग्स
id: Pengaturan
ur: سیٹنگز
vi: Cài đặt

# upgrade_to_premium
source: Upgrade to the Premium
hi: प्रीमियम में अपग्रेड करें
id: Tingkatkan ke Premium
ur: پریمیم پر اپ گریڈ کریں
vi: Nâng cấp lên cao cấp

source: Test Date
hi: परीक्षा की तारीख
id: Tanggal Tes
ur: ٹیسٹ کی تاریخ
vi: Ngày thi

source: Preferences
hi: प्राथमिकताएँ
id: Preferensi
ur: ترجیحات
vi: Tùy chỉnh

source: Use Haptic Feedback?
hi: हैप्टिक प्रतिक्रिया का उपयोग करें?
id: Gunakan umpan balik haptic?
ur: کیا ہپٹک فیڈبیک استعمال کریں؟
vi: Sử dụng phản hồi rung?

source: Other
hi: अन्य
id: Lainnya
ur: دیگر
vi: Khác

source: Rate Us
hi: हमें रेट करें
id: Beri Rating
ur: ہمیں ریٹ کریں
vi: Đánh giá chúng tôi

source: Share App
hi: ऐप साझा करें
id: Bagikan Aplikasi
ur: ایپ شیئر کریں
vi: Chia sẻ ứng dụng

source: Privacy Policy
hi: गोपनीयता नीति
id: Kebijakan Privasi
ur: پرائیویسی پالیسی
vi: Chính sách quyền riêng tư

source: Language
hi: भाषा
id: Bahasa
ur: زبان
vi: Ngôn ngữ

source: Canada Jobs
hi: कनाडा नौकरियां
id: Pekerjaan di Kanada
ur: کینیڈا میں نوکریاں
vi: Việc làm Canada

source: Clear Progress
hi: प्रगति साफ करें
id: Hapus Kemajuan
ur: پیش رفت صاف کریں
vi: Xóa tiến trình

source: Send Feedback
hi: प्रतिक्रिया भेजें
id: Kirim Umpan Balik
ur: فیڈبیک بھیجیں
vi: Gửi phản hồi

# feedback_dialog_desc
source: This option is only for giving feedback. If you face any issue, please contact us directly through the support option in the app.
hi: यह विकल्प केवल प्रतिक्रिया भेजने के लिए है। यदि आपको कोई समस्या है, तो कृपया ऐप में सहायता विकल्प के माध्यम से सीधे हमसे संपर्क करें।
id: Opsi ini hanya untuk mengirim umpan balik. Jika Anda mengalami masalah, silakan hubungi kami langsung melalui opsi dukungan di aplikasi.
ur: یہ آپشن صرف فیڈبیک دینے کے لیے ہے۔ اگر آپ کو کوئی مسئلہ درپیش ہے تو براہ راست ایپ کے اندر سپورٹ آپشن سے ہم سے رابطہ کریں۔
vi: Tùy chọn này chỉ để gửi phản hồi. Nếu bạn gặp sự cố, vui lòng liên hệ trực tiếp với chúng tôi thông qua tùy chọn hỗ trợ trong ứng dụng.

# write_your_feedback
source: Write your feedback here...
hi: यहां अपनी प्रतिक्रिया लिखें...
id: Tulis umpan balik Anda di sini...
ur: اپنی فیڈبیک یہاں لکھیں...
vi: Viết phản hồi của bạn tại đây...

source: Submit
hi: सबमिट करें
id: Kirim
ur: جمع کروائیں
vi: Gửi

# are_you_sure_you_want_to_clear
source: Are you sure you want to clear your progress? This action cannot be undone.
hi: क्या आप वाकई अपनी प्रगति साफ़ करना चाहते हैं? यह क्रिया पूर्ववत नहीं की जा सकती।
id: Apakah Anda yakin ingin menghapus kemajuan Anda? Tindakan ini tidak dapat dibatalkan.
ur: کیا آپ واقعی اپنی پیش رفت صاف کرنا چاہتے ہیں؟ یہ عمل ناقابل واپسی ہے۔
vi: Bạn có chắc chắn muốn xóa tiến trình của mình không? Hành động này không thể hoàn tác.

source: Cancel
hi: रद्द करें
id: Batal
ur: منسوخ کریں
vi: Hủy

source: Clear
hi: साफ करें
id: Hapus
ur: صاف کریں
vi: Xóa

source: Pass the first time!
hi: पहली बार में पास करें!
id: Lulus di percobaan pertama!
ur: پہلی بار میں پاس کریں!
vi: Đỗ ngay lần đầu tiên!

# upgrade_now_to_gain_full_access
source: Upgrade now to gain full access to all the chapters, tests and features!
hi: सभी चैप्टर, टेस्ट और सुविधाओं तक पूरी पहुँच के लिए अभी अपग्रेड करें!
id: Tingkatkan sekarang untuk mendapatkan akses penuh ke semua bab, tes, dan fitur!
ur: مکمل رسائی کے لیے ابھی اپ گریڈ کریں، تمام ابواب، ٹیسٹ اور فیچرز حاصل کریں!
vi: Nâng cấp ngay để có quyền truy cập đầy đủ vào tất cả các chương, bài kiểm tra và tính năng!

source: Ad
hi: विज्ञापन
id: Iklan
ur: اشتہار
vi: Quảng cáo

source: Watch an ad instead
hi: इसके बजाय एक विज्ञापन देखें
id: Tonton iklan sebagai gantinya
ur: اس کے بجائے ایک اشتہار دیکھیں
vi: Xem quảng cáo thay thế

source: Unlock this test for free
hi: इस टेस्ट को मुफ्त में अनलॉक करें
id: Buka tes ini secara gratis
ur: یہ ٹیسٹ مفت میں ان لاک کریں
vi: Mở khóa bài kiểm tra này miễn phí

# unlimited_access_to_all_chapters
source: Unlimited access to all 14 chapters
hi: सभी 14 चैप्टर तक असीमित पहुँच
id: Akses tanpa batas ke semua 14 bab
ur: تمام 14 ابواب تک لامحدود رسائی
vi: Truy cập không giới hạn tất cả 14 chương

# unlimited_access_to_practice_tests
source: Unlimited access to 45+ practice tests
hi: 45+ प्रैक्टिस टेस्ट तक असीमित पहुँच
id: Akses tanpa batas ke lebih dari 45 tes latihan
ur: 45+ پریکٹس ٹیسٹ تک لامحدود رسائی
vi: Truy cập không giới hạn hơn 45 bài kiểm tra thực hành

# listen_to_all_lessons
source: Listen to all of the lessons with audio
hi: ऑडियो के साथ सभी पाठ सुनें
id: Dengarkan semua pelajaran dengan audio
ur: تمام اسباق کو آڈیو کے ساتھ سنیں
vi: Nghe tất cả các bài học có âm thanh

# lessons_and_questions
source: Province-specific lessons and questions
hi: प्रांत-विशिष्ट पाठ और प्रश्न
id: Pelajaran dan pertanyaan khusus provinsi
ur: صوبہ مخصوص اسباق اور سوالات
vi: Bài học và câu hỏi theo tỉnh

source: Start Chapter Practice
hi: अध्याय अभ्यास शुरू करें
id: Mulai Latihan Bab
ur: باب کی مشق شروع کریں
vi: Bắt đầu luyện chương

source: RESTORE
hi: पुनर्स्थापित करें
id: Pulihkan
ur: بحال کریں
vi: Khôi phục

source: Reminder
hi: अनुस्मारक
id: Pengingat
ur: یاد دہانی
vi: Nhắc nhở

source: Daily Practice Time
hi: दैनिक अभ्यास समय
id: Waktu Latihan Harian
ur: روزانہ مشق کا وقت
vi: Thời gian luyện tập hàng ngày

source: Current Score
hi: वर्तमान स्कोर
id: Skor Saat Ini
ur: موجودہ اسکور
vi: Điểm hiện tại

source: Restart Test
hi: परीक्षा पुनः प्रारंभ करें
id: Mulai Ulang Tes
ur: ٹیسٹ دوبارہ شروع کریں
vi: Làm lại bài kiểm tra

source: Finish Test
hi: परीक्षा समाप्त करें
id: Selesai Tes
ur: ٹیسٹ ختم کریں
vi: Kết thúc bài kiểm tra

source: Main Menu
hi: मुख्य मेनू
id: Menu Utama
ur: مین مینو
vi: Menu chính

source: Report an issue
hi: समस्या की रिपोर्ट करें
id: Laporkan masalah
ur: مسئلہ رپورٹ کریں
vi: Báo cáo sự cố

source: Light Mode
hi: प्रकाश मोड
id: Mode Terang
ur: روشن موڈ
vi: Chế độ sáng

source: Dark Mode
hi: डार्क मोड
id: Mode Gelap
ur: تاریک موڈ
vi: Chế độ tối

source: Improve your score
hi: अपना स्कोर सुधारें
id: Tingkatkan skor Anda
ur: اپنا اسکور بہتر بنائیں
vi: Cải thiện điểm số của bạn

# continue_taking_prectice_test
source: Continue taking practice test
hi: अभ्यास परीक्षा जारी रखें
id: Lanjutkan tes latihan
ur: پریکٹس ٹیسٹ جاری رکھیں
vi: Tiếp tục làm bài kiểm tra thử

# continue_readding_official_handbook
source: Continue reading the official handbook
hi: आधिकारिक पुस्तिका पढ़ना जारी रखें
id: Lanjutkan membaca buku panduan resmi
ur: سرکاری ہینڈ بک پڑھنا جاری رکھیں
vi: Tiếp tục đọc sổ tay chính thức

source: Score Statistics
hi: स्कोर आँकड़े
id: Statistik skor
ur: اسکور کے اعداد و شمار
vi: Thống kê điểm số

source: Last test
hi: अंतिम परीक्षण
id: Ujian terakhir
ur: آخری ٹیسٹ
vi: Bài kiểm tra cuối cùng

source: Last
hi: अंतिम
id: Terakhir
ur: آخری
vi: Cuối cùng

source: tests
hi: परीक्षण
id: ujian
ur: ٹیسٹ
vi: bài kiểm tra

# all_test
source: All tests
hi: सभी परीक्षण
id: Semua ujian
ur: تمام ٹیسٹ
vi: Tất cả các bài kiểm tra

source: Terms And Conditions
hi: नियम और शर्तें
id: Syarat dan Ketentuan
ur: شرائط و ضوابط
vi: Điều khoản và Điều kiện

source: Refund Policy
hi: धनवापसी नीति
id: Kebijakan Pengembalian Dana
ur: ریفنڈ پالیسی
vi: Chính sách Hoàn tiền
